app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `school_id` = '2024110001'
 LIMIT 1
---
    public function associateLogin()
    {
        $users = new Users();

        // Get form data
        $associateNumber = $this->request->getPost('associateNumber');
        $password = $this->request->getPost('password');

        // Find user by associate number
        $user = $users->where('school_id', $associateNumber)->first();