app/Controllers/PersonnelController.php

UPDATE `users` SET `first_name` = 'Juan', `middle_name` = '', `last_name` = 'Dela Cruz', `email` = 'juandelacruz@email.com', `birthdate` = '2024-11-01', `gender` = 'male', `department` = 'Information Technology', `role` = 'student', `updated_at` = '2024-12-01 04:22:40'
WHERE `users`.`id` IN ('1')
---
        }

        // Attempt to update data
        if ($userModel->update($id, $data)) {